Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.Contains Method
 Determines whether an element is in the collection.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Contains(
	BinaryFilterExpressionItem Item
)
Public Function Contains (
	Item As BinaryFilterExpressionItem
) As Boolean
Parameters
Item
Type: Tekla.Structures.Filtering.BinaryFilterExpressionItem
The object to locate in the collection. This value cannot be null.
Return Value
Type: Boolean
True if the object exists.
Implements
ICollection<T>.Contains(T)
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the supplied item is null.
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace